[
  {
    "chunk_id": "Chunk 1",
    "summary": "The Reddit user 'kojied' expresses a feeling of discomfort and violation while visiting a bar that was filled with young, college-aged individuals. They describe the situation as being more like a wild college party, which they found unexpected and inappropriate in the context of the bar's typically mature vibe.\n\nThe user reflects on the situation and questions their own judgment, acknowledging that they are also transient in the city, albeit having lived there for three years, and that others may find New York City equally adventurous regardless of their length of stay.\n\nIn response to a comment about maintaining character consistency in a game, the user mentions that they do indeed maintain a consistent character image but often do not finish games due to insufficient late-game content.",
    "sources": [
      {
        "text": "I feel violated by intern season\n\nThere's this bar that I frequent a few blocks away from my house. ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/newyorkcity/comments/1lykkqf/i_feel_violated_by_intern_season/"
      },
      {
        "text": "Sorry to hear that man, in the future you may want to have multiple granaries, one close to your ber",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ManorLords/comments/1ly3nuf/my_granary_burned_down/n2r16t2/"
      },
      {
        "text": "Yeah but it doesn’t seem to affect much though",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ManorLords/comments/1lwfdh8/anyone_else_having_an_issue_where_their_trading/n2dn0vm/"
      },
      {
        "text": "Incredible stuff! How did you maintain character consistency? Did you generate a consistent characte",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ChatGPT/comments/1lvtwj3/i_used_ai_to_create_this_short_film_on_human/n2b07h0/"
      },
      {
        "text": "I do too but I rarely finish a game haha. Too little late game content",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ManorLords/comments/1lse9cn/great_game_i_hope_there_is_something_new_added_in/n1i5k2p/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 2",
    "summary": "The Reddit user 'kojied' discusses their gameplay experience, focusing on a game that seems to involve resource management and town development. They mention that they often don't finish games due to insufficient late-game content. They suggest strategies for resource gathering, such as killing bandit units, donating crop yields through the manor, and trading raw materials for easier profit. They find trading raw materials more convenient than trading crafted goods in the current game build.\n\nHowever, they note that high-demand items like plate armor are difficult to trade due to their low quantity and time-consuming production process. They also share their struggle when upgrading to tier 3, which caused their town to become chaotic due to increased resource demands. Lastly, they mention that each family in the game consumes all types of food equally, and since eggs are produced only once per month, they can help maintain food diversity but may not be sufficient on their own.",
    "sources": [
      {
        "text": "I do too but I rarely finish a game haha. Too little late game content",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ManorLords/comments/1lse9cn/great_game_i_hope_there_is_something_new_added_in/n1i52vu/"
      },
      {
        "text": "You have to kill the bandit units, or donate crop yields though the manor (tithing, different from t",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ManorLords/comments/1lscpmo/how_does_influence_on_hard_work/n1hhd7z/"
      },
      {
        "text": "That proximity is ridiculous, deep mining, two fishing huts, vegetable, orchards, and trade iron for",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ManorLords/comments/1lq4lst/this_is_acceptable/n1089i9/"
      },
      {
        "text": "Yeah I was doing alright and then as soon as I upgraded to tier 3 my town was in shambles. I didn’t ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ManorLords/comments/1ljgy2w/confession/mzopv8i/"
      },
      {
        "text": "So in general each family will eat each type of food equally. Which means those with low supply are ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ManorLords/comments/1lihry5/am_i_doing_something_wrong_with_food_management_i/mzc2uit/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 3",
    "summary": "The Reddit user 'kojied' is primarily interested in discussing city-building strategy in a game, sharing their preferences for food and coffee establishments, and expressing their opinions on the current state of NFTs, including the lack of innovation, decreased hype, and potential for future revival. They also comment on the lifestyle trends of millennials, with fewer children, more time and money for self-care, and a later age for marriage. Additionally, they shared a humorous anecdote about a social encounter where they wore a toga and their counterpart did not. Overall, their activity on Reddit is a mix of gaming, lifestyle, and technology discussions.",
    "sources": [
      {
        "text": "I build my cities close to the borders of others, that way I'm not managing multiple cities at once.",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ManorLords/comments/1lg0qii/the_ability_to_combine_regions_or_make_aivassal/myulv47/"
      },
      {
        "text": "Breakfast - Buvette\n\nCoffee - Lyria\n\nLunch - Tsukemen okiboru\n\nCoffee - La cabra\n\nDinner - Isodi\n\nDr",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/FoodNYC/comments/1lc0fio/if_you_had_to_spend_one_full_day_eating_your_way/mxxhvpf/"
      },
      {
        "text": "\\- the hype has definitely faded, you can see that with the price as well as the number of people di",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/NFT/comments/1l2gcmt/nfts_in_2025_where_are_we_headed/mvt4t5c/"
      },
      {
        "text": "Millenials have less kids, so they have more time and money to spend on themselves. Millenials are a",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1kz5a0n/do_you_think_millennials_generally_look_younger/mv2xf3q/"
      },
      {
        "text": "I wore a toga. she showed up in regular clothes",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1ksghx5/what_happened_on_the_first_date_that_made_you/mtnzw3v/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 4",
    "summary": "The user 'kojied' is a Japanese individual who posted a comment about a Mother's Day message written in Japanese. They explained that the message translates to \"Dear mom, everything I encounter from now is thanks to you\" and is associated with a Mother's Day special chocolate. They also mentioned that the phrase \"naraku ochi\" (falling from the stage) is not an expression for child suicide, despite being misconstrued as such.\n\nThe user expressed an interest in creating photorealistic ASCII art and asked for tips on achieving more consistent characters. They also shared their observation that our eyes are more forgiving when it comes to cartoon-style art compared to photorealistic art.",
    "sources": [
      {
        "text": "Closest expression is naraku ochi 奈落落ち which means falling from the stage, used in kabuki. It’s a wa",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/OnePiece/comments/1kpavbs/ive_been_ripping_on_that_part_of_zoros_backstory/mswlma6/"
      },
      {
        "text": "Fyi it says\n“Dear mom, everything I encounter from now is thanks to you”\n(It’s a Mother’s Day specia",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/OnePiece/comments/1kalm70/spotted_at_my_local_heiwado/mpo38g6/"
      },
      {
        "text": "how did you make that diagram? I've been doing it in ascii lol",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/RooCode/comments/1jwf8oq/heres_how_i_make_use_of_the_different_modes_in/mmih39e/"
      },
      {
        "text": "It’s pretty hard to get consistent characters when they’re photorealistic tbh. I guess our eyes are ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ChatGPT/comments/1jpagk5/to_me_the_most_impressive_new_feature_is_the/ml31o85/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 5",
    "summary": "The Reddit user 'kojied' appears to be discussing strategies for city-building games, specifically mentioning the importance of maritime trade when setting up on the coast. They show an interest in video creation, as they mention creating 60fps videos from OAI images. They also express surprise at the details in the game Project Zomboid, particularly the need for a pipe wrench to plumb a sink. Lastly, they discuss a situation where an advanced player can manipulate AI in games by only providing them with resources they don't need, such as gold or iron/coal.",
    "sources": [
      {
        "text": "Can’t really discuss this without your strategy. If you’re setting up on the coast over river, your ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1jlw2ao/rate_my_starting_locaiton/mk73w0o/"
      },
      {
        "text": "imagine making 60fps videos with photos from OAI images. nothing on the internet can be trusted",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ChatGPTJailbreak/comments/1jliha3/i_cant_believe_i_made_it_do_this_note_i_do_not/mk4no36/"
      },
      {
        "text": "Surprised I don’t see project zomboid. Graphics are retro but the game is so well made. Who knew tha",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1iz0bzi/which_game_proves_that_graphics_arent_everything/mezpeha/"
      },
      {
        "text": "This happens when you are in an advanced technological era than the AI. You can adjust to only give ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1iuhdh9/dude_tf/mdxgebg/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 6",
    "summary": "The Reddit user 'kojied' appears to have a diverse range of interests, including sports, particularly basketball, and avian behavior, as evidenced by their discussion about a hypothetical trade agreement with England and the mention of a 'pigeon whisperer' in Washington Square Park. They also seem to have a keen eye for observing the pressure and performance dynamics in sports. Additionally, they share insights about pigeon-populated locations in New York City. However, it's important to note that this analysis is based on a single Reddit post and may not fully capture the user's overall interests or behavior.",
    "sources": [
      {
        "text": "Would you be interested in a trade agreement with England?",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1i6rkdz/gamers_dont_say_the_title_of_the_game_but_what/m8gl211/"
      },
      {
        "text": "He used to shoot well and have impact when no one had him on the radar, and opponents didn’t have hi",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/warriors/comments/1hq7r88/can_someone_explain_why_lindy_is_out_there_over/m4prpxf/"
      },
      {
        "text": "Not in Chelsea but Washington square park has the pigeon whisperer. Bear in mind he’s definitely ecc",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskNYC/comments/1hpnjqr/ridiculous_question_anybody_know_where_in_chelsea/m4j0ese/"
      },
      {
        "text": "Also left, considering there’ll be an awkward gap between your 3rd city, where AI civs will most lik",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1hp1es7/forward_settle_on_deity/m4dyqsa/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 7",
    "summary": "User 'kojied' appears to be an active participant on r/Civ6, a subreddit dedicated to the strategy game Civilization VI. In the provided excerpts, they discuss their frustrations with other players (Venice and Austria) in the game, accusing them of buying city-states and skewing the World Congress votes, as well as spamming missionaries excessively. They also express concern about the balance between growth tiles and the Petra wonder, feeling that growth tiles (excluding oasis) are not effectively buffed by Petra.\n\nAdditionally, they appear to engage in unrelated casual conversation, such as commenting on a cloud in a shower context. Lastly, they seem to be anticipating a game outcome with a 5-point deficit and expressing readiness for potential disappointment.",
    "sources": [
      {
        "text": "Is this r/2nordic4you",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1hoydmz/if_you_could_be_born_again_which_country_would/m4dcgg6/"
      },
      {
        "text": "Venice and Austria are annoying since they buy city states, skewing with the world congress votes. A",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1hhujby/ranking_the_ai_by_how_dangerous_they_are_on_high/m4dc5oo/"
      },
      {
        "text": "It’s a hard balance to strike, since without growth tiles you can’t reach a pop to build Petra befor",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1hoywu7/my_first_game_with_ige_mod_usage_and_an_ideal/m4dbpn9/"
      },
      {
        "text": "Calm down he’s talking about the cloud making the shower",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/OnePiece/comments/1hoop3e/what_did_chopper_say/m4b9nvl/"
      },
      {
        "text": "Ok 5 more min with a 5pt deficit. I’m ready to be disappointed again",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/warriors/comments/1hojayb/game_thread_202425_nba_regular_season_golden/m4av54h/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 8",
    "summary": "User 'kojied' on Reddit seems to be discussing the high cost of purchasing a cafe in Paris, expressing skepticism that 18,000 dollars would be sufficient. They then switch topics to discuss the visa process for international students in the United States, mentioning the F1 visa, STEM OPT, and H1B visa. Lastly, they reference a character named Bonny and make a comparison of another character, Chopper, to a deer (🦌). The context of these references is unclear within the given snippet.",
    "sources": [
      {
        "text": "The most unrealistic part is that 18k will get you a cafe in Paris 🇫🇷 ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/aivideo/comments/1fidnz4/the_most_emotional_ai_film_youve_seen_yet_4/m4aby21/"
      },
      {
        "text": "Little do they know many “top American colleges” have a ton of international students on an F1 visa,",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/LeopardsAteMyFace/comments/1hohsjk/rconservative_is_in_fullon_meltdown_right_now_its/m49vhkh/"
      },
      {
        "text": "&lt;Spoiler&gt;\n\n\n\n\n\n\n\nAlso we now know that’s current Bonny",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/OnePiece/comments/1ho4rnp/one_piece_characters_child_version/m49mtej/"
      },
      {
        "text": "Chopper literally a 🦌 ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/OnePiece/comments/1ho4rnp/one_piece_characters_child_version/m49mpg3/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 9",
    "summary": "The Reddit user 'kojied' appears to be expressing disappointment and frustration with the performance of the Golden State Warriors in basketball games, suggesting that they often build up hope only to disappoint. They have also expressed a feeling of disillusionment with the amount of advertisements during games, making it seem more like watching ads with occasional basketball. Additionally, 'kojied' has shared their personal experience of migrating to the US and being a H1B holder, asking for the opinions of others about the narrative that H1B holders are being exploited.",
    "sources": [
      {
        "text": "I’m not going to be disappointed anymore. I know how the warriors give us slight hope just to disapp",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/warriors/comments/1hnvrmw/game_thread_202425_nba_regular_season_golden/m45hfw5/"
      },
      {
        "text": "Didn’t doubt warriors would lose this one",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/warriors/comments/1hnvrmw/game_thread_202425_nba_regular_season_golden/m45hcfu/"
      },
      {
        "text": "Am I watching basketball with ads or ads with some basketball sprinkled in between",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/warriors/comments/1hnckfr/daily_discussion_thread_december_27_2024/m45d3eq/"
      },
      {
        "text": "I used to be one, and I’m grateful for the opportunity to find a better life here in the US",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1hnx8j0/h1b_holders_what_are_your_thoughts_on_the/m4560kx/"
      },
      {
        "text": "H1B holders, what are your thoughts on the narrative that you are being exploited?",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1hnx8j0/h1b_holders_what_are_your_thoughts_on_the/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 10",
    "summary": "The Reddit user 'kojied' primarily discusses three main topics in their posts:\n\n1. H1B Visa holders in the US: They express concerns about the potential exploitation of H1B workers and emphasize that this issue transcends political boundaries. They hope for meaningful solutions to be developed to address the issue.\n\n2. Basketball and the NBA: They admire Stephen Curry's performance in the sport but are critical of the league's reliance on gambling and excessive advertising. They advocate for reducing ad breaks, ensuring consistent referee calls, and eliminating gambling from the league.\n\n3. Art and museum visits: They mention visiting places like the Cloisters and Noguchi museum, as well as other art galleries. They also share an issue they encountered with a virtual assistant, stating that it stops responding after a certain number of interactions.",
    "sources": [
      {
        "text": "H1B holders, do you feel exploited, or see it as an opportunity to build a better life for you in th",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1hnx7lj/h1b_holders_do_you_feel_exploited_or_see_it_as_an/"
      },
      {
        "text": "I’m hoping people realize after this that it’s not a left or right issue, but rather those with weal",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/OptimistsUnite/comments/1hnvi2y/i_made_a_post_a_month_or_so_back_that_maga_will/m454yr1/"
      },
      {
        "text": "I’m definitely done after curry. It was awesome seeing an underdog like him demolish taller players,",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/warriors/comments/1hnrjru/future_of_the_league/m454lgx/"
      },
      {
        "text": "Cloisters, Noguchi museum, more art galleries",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskNYC/comments/1hntgrp/what_is_your_nyc_to_do_list_for_2025/m453mqo/"
      },
      {
        "text": "You can ask it to alter its speed and complexity of the response if you ask it to. It'll update its ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/ChatGPT/comments/1hh2q9r/voice_mode_has_been_brutally_nerfed/m2nxxav/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 11",
    "summary": "The Reddit user 'kojied' is observed to be engaged in discussions related to train safety, expressing concern about closing doors and the potential for someone getting stuck. They also seem to have an interest in organizing events such as a Timothée Chalamet lookalike contest. They humorously acknowledge that they are part of the top 1% of Reddit users.",
    "sources": [
      {
        "text": "They're in the middle so they can see the door closing, making sure no one gets stuck. Other trains ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskNYC/comments/1hcsb8n/what_do_the_conductors_in_the_middle_subway_cars/m1qihqd/"
      },
      {
        "text": "What needs to happen for the league to review the inconsistencies of the refs?\n\n[removed]",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/nba/comments/1hcopxo/what_needs_to_happen_for_the_league_to_review_the/"
      },
      {
        "text": "I’m down to help! Do it at wsp and put up fliers around the city. \nLike the Timothée Chalamet lookal",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskNYC/comments/1haran2/if_i_created_a_memorial_for_all_those_denied/m1ax9to/"
      },
      {
        "text": "Apparantly you’re the top 1% here on reddit lolol",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/warriors/comments/1h9zxoq/wife_got_courtside_box_seats_from_her_company_and/m15gny0/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 12",
    "summary": "The Reddit user 'kojied' has posted a series of unrelated and seemingly unconnected comments. The first comment suggests they are utilizing Google Cloud Platform (GCP) credits and finds it amusing. The second comment expresses frustration with a health insurance claim denial, indicating a personal experience with an insurance company.\n\nThe third and fourth comments seem to be in the context of a hypothetical zombie apocalypse, as the user suggests stocking up on axes, sledgehammers, generator magazines, skill tapes, and securing food and water, along with suggestions for home modifications to prevent zombie access. The \"burglar trait\" in the fourth comment might be a reference to a game or fantasy scenario, as it seems out of place in the context of the zombie apocalypse setup. The phrase \"iykyk\" is internet slang that stands for \"if you know, you know,\" implying that the described scenario is specific or obscure enough that only those familiar with it would understand.",
    "sources": [
      {
        "text": "Our GCP Credits hard at work haha",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/warriors/comments/1h9zxoq/wife_got_courtside_box_seats_from_her_company_and/m14y4pr/"
      },
      {
        "text": "Having your health insurance claim denied. \nYou think you’re covered because you’ve paid diligently ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1h9x0az/deleted_by_user/m14jlnj/"
      },
      {
        "text": "Apparantly wallframes are better because they don’t break",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1h8yia2/the_zombie_apocalypse_has_begun_whats_the_first/m1032p9/"
      },
      {
        "text": "Go to the fire station and stock up on axes. Then go to the hardware store and get a sledgehammer. D",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1h8yia2/the_zombie_apocalypse_has_begun_whats_the_first/m0wmp5q/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 13",
    "summary": "The Reddit user 'kojied' frequently participates in discussions about the game Civilization VI, sharing strategies and tips for gameplay. Their recent activity includes discussing the optimal strategy for progressing in the game, which involves prioritizing certain actions like rushing to fill artist and writer slots, focusing on the Renaissance era, using the bulb scientist for additional science output, and paying neighbors to fight each other to avoid attacks. They also mention that they are ahead of the AI in terms of technological progress and that the gameplay can become repetitive, so they are trying to find ways to diversify it. The user visits the subreddit once a month and has recently suggested a meeting time for a game with others.",
    "sources": [
      {
        "text": "The drain is not swamping",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/LeopardsAteMyFace/comments/1h8cmh8/trump_appointing_billionaires_oh_no_anyways/m0s5zos/"
      },
      {
        "text": "Are you guys for/against banning Tiktok in the US?\n\n[removed]",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/Conservative/comments/1h8ddbp/are_you_guys_foragainst_banning_tiktok_in_the_us/"
      },
      {
        "text": "Oh interesting, I've been going about once a month recently but haven't noticed. I'm going on Sunday",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/FoodNYC/comments/1h87emd/did_rakus_noodle_recipe_change/m0rzprt/"
      },
      {
        "text": "That’s a good suggestion. I’ve found the level below to be too easy doing the optimal route, so will",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1h7bmv3/flight_deity/m0lub7c/"
      },
      {
        "text": "The optimal strategy I've discovered is the following\n\n1. rush artist/writer slots and fill them\n2. ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1h7bmv3/flight_deity/m0jx8h5/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 14",
    "summary": "Reddit user 'kojied' appears to be a strategic-minded individual with a love for pie, particularly whole pies from John's on Bleecker Street. They enjoy maximizing efficiency, as evidenced by their preference for working every specialist slot in their city, using bulb scientists, and their preference for a whole pie over a slice. They are mindful of others, advising to avoid slowing down and blocking pedestrians while admiring the view.\n\nThis user also shows an interest in public transportation, suggesting the use of Coach USA buses for travel to Penn Station, Bryant Park, or Grand Central. They offer practical advice about ticket purchasing, whether through the Coach USA app or paying cash at the bus stop. However, they also suggest considering Uber if traveling in a group of four, as the price point may not differ significantly. They also mention a pro-West leaning bias in the subreddit they are posting in, but they enjoy engaging with content from both pro-West (this subreddit) and pro-China (r/sino) communities to gain a balanced perspective.",
    "sources": [
      {
        "text": "Hermit with internal trade routes, max rationalism, work every specialist slot, bulb scientists, yee",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1h61fr0/on_a_post_about_trade_tariffs/m0a6ok5/"
      },
      {
        "text": "Don’t walk slow. If you’re going to admire the view do it out of the way of pedestrians",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskNYC/comments/1h2aw9v/whats_one_thing_you_would_tell_a_tourist_to_never/lzi30jy/"
      },
      {
        "text": "Whole pie is always better than a slice. You can get a good sit down pie between two people, or to t",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/FoodNYC/comments/1h1zo4k/best_place_to_try_ny_pizza_for_a_first_timer/lzfhgsj/"
      },
      {
        "text": "I’ve noticed this sub is pro-West leaning. If you want a pro-China leaning response you should check",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/China/comments/1h1smq1/whats_the_best_way_as_a_tourist_to_see_the/lze3b0d/"
      },
      {
        "text": "The Coach USA bus takes you to Penn station, Bryant Park, or Grand central. If there's 4 of you I'd ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskNYC/comments/1gzmo85/newark_airport_to_midtown/lyyqsop/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 15",
    "summary": "User 'kojied' on Reddit appears to be discussing various topics in multiple threads. In one thread, they seem to express frustration with the quality of air travel, specifically mentioning flight delays, older aircraft, noise, and narrower cabin space. They also talk about a device they own, which they find has insufficient battery life for long flights and is not suitable for use at work due to social awkwardness. However, they enjoy using it for immersive video experiences on AppleTV.\n\nIn another thread, they seem to be discussing a strategy for a game, possibly a strategy game like Age of Empires, as they mention \"spamming cheap units\" and \"tithe.\" They mention that the AI in the game doesn't often pick \"tithe,\" and they plan to try a strategy that includes it.",
    "sources": [
      {
        "text": "Bold of you to assume I’m out of my bed",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1gyerwn/what_gets_you_out_of_bed_in_the_morning/lyr8hvi/"
      },
      {
        "text": "My personal experience has definitely gotten worse.\nFlight delays are expected at this point, fleets",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskNYC/comments/1gx5sln/has_air_travel_gotten_worse/lyei609/"
      },
      {
        "text": "I’m not using it as frequently as I had wished. The battery life is too low to use while flying (eve",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/VisionPro/comments/1gw2bof/should_i_get_one/ly658s7/"
      },
      {
        "text": "You should spam cheap units like scouts into their territory so their units are forced into moving w",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1gvke1r/why_does_budapest_refuse_to_attack_assur/ly3ovey/"
      },
      {
        "text": "The problem is that tithe is so op, and for some reason AI never pick it. I’ve never done your strat",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1gumxga/what_adjustments_have_you_made_after_at_least_a/lxvjw46/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 16",
    "summary": "The Reddit user 'kojied' prefers in-person encounters over dating apps, finding that apps often make dating feel trivial due to the ease of finding multiple potential matches. They share that they leave quality comments on dating apps and about one-third of these result in matches, with some users not responding but often replying when prompted. They note that the types of people they are attracted to may not be as skilled in conversation or may not care as much due to receiving many matches.\n\nIn a separate thread, the user discusses shopping, suggesting visiting clothing sales on the first day to avoid selling out and waiting an hour or two. They recommend asking a female friend with good taste in clothes to accompany them for shopping advice. They also mention checking out the 260 sample sale for favorite brands and second street for second-hand clothing.\n\nThe user's favorite clothing brands include APC, Acne Studios, Rag&Bone, and Maison Kitsune. They also express frustration that a play they were part of could not be stopped, indicating they may have an interest in theatre or acting.",
    "sources": [
      {
        "text": "Dating apps have been normalized but I still would prefer irl encounters compared to apps. Apps also",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/seduction/comments/1gtot3j/hinge_dating_app_review_and_perspective/lxopx3y/"
      },
      {
        "text": "In person 100% You never know if it fits you unless you see it irl. The lines can get long, but it’s",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskNYC/comments/1gshr7i/fashionable_ppl_of_nyc_where_do_you_shop_for_mens/lxifvet/"
      },
      {
        "text": "At that height you should check out 260 sample sale for your favorite brands. They have good brands ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskNYC/comments/1gshr7i/fashionable_ppl_of_nyc_where_do_you_shop_for_mens/lxfmito/"
      },
      {
        "text": "The crazy part is that they still couldn’t get a stop on this play!",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/warriors/comments/1gr4uix/the_shining_triplets_defense/lx3tz1r/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 17",
    "summary": "The Reddit user 'kojied' is offering advice and personal recommendations to another user on enhancing their appearance, primarily focusing on fashion, fitness, skincare, and grooming.\n\n1. Suggestions for appearance enhancement include:\n   - Considering contacts or LASIK for better vision\n   - Working out and building muscle through cardio, eating healthier, and weightlifting exercises like bench and squats\n   - Improving fashion sense by shopping at Uniqlo and Cos, and avoiding excessive anime-related clothing\n   - Grooming tips such as getting eyebrows threaded, using specific skincare products, and potentially shaving their head with a high-end electric razor\n\n2. Additional advice on social interaction:\n   - Be open to new experiences with people, as it can help build confidence\n   - Learn from mistakes and grow as a person\n\n3. A general recommendation to shave their head with a specific electric razor model.",
    "sources": [
      {
        "text": "Made in Abyss and Akihito Tsukushi. Some say it’s peak anime",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1god9lw/whats_the_most_egregious_example_of_the_writers/lwi7ldf/"
      },
      {
        "text": "Literally me. Diety Persia Petra with Chechen Itza",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1gk8ez5/election_date_in_the_us_means_time_to_reinstall/lvouujm/"
      },
      {
        "text": "First of all you look good! But if you want to become more \"conventionally attractive\", here are som",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/GenZ/comments/1gc4gbc/i_want_to_be_more_conventionally_attractive_you/ltr38yh/"
      },
      {
        "text": "I think you should just shave it off entirely. Get this shaver, it's a bit pricy but you'll never ha",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/GenZ/comments/1gc4gbc/i_want_to_be_more_conventionally_attractive_you/ltqzj9f/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 18",
    "summary": "The Reddit user 'kojied' discusses the benefits and drawbacks of building a Great Library in the civilization game, Civilization VI. They suggest that while the Great Library can be beneficial for getting to Theology faster, leading to the construction of Borobudur, it is less effective for military or early scientific advantages. They also mention that in higher difficulty levels, such as Deity, the AI's technological advancement makes the Great Library less relevant. They express interest in a mod that could automate the strategy of prioritizing the Great Library for religious victory.",
    "sources": [
      {
        "text": "fyi aircrafts don't get this benefit, so building a city next to it won't be worth it",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1g130ld/i_played_for_so_many_years_i_have_never_ran_into/lrf0nnw/"
      },
      {
        "text": "There are some key technologies which can give you significant advantage in the early game, either i",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1fw0b0w/is_the_great_library_really_not_worth_it_has_my/lqb18ti/"
      },
      {
        "text": "Is there a mod which automatically does this? Would be very helpful :/",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1fu9cfo/late_game_load_times_are_unbearable_for_everyone/lpyweyu/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 19",
    "summary": "The user 'kojied' is discussing their gameplay experience in a strategy game, likely Civilization. They talk about the factors influencing the AI's behavior in the game, mentioning military strength, resources, and the civ's propensity for war. According to the user, aggressive civs tend to attack more often but are easier to bribe, while peaceful civs like Gandhi are harder to provoke. They also suggest using the AI's aggression against each other to gain an advantage.\n\nIn a separate comment, the user expresses frustration about a construction project in a residential area, possibly referring to a real-world situation. Lastly, they reminisce about a past experience where a construction project caused inconvenience for a significant period. However, the outcome was apparently positive.",
    "sources": [
      {
        "text": "This is a painting!? from 1955!? Incredible",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/museum/comments/1ftl9b2/karen_hollingsworth_b1955_unwind/lpucbzy/"
      },
      {
        "text": "It’s a combination of multiple factors, your military strength, the amount of GPT/luxury you can off",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1fszao0/how_often_can_you_beat_deity/lpqalrm/"
      },
      {
        "text": "It depends on who’s my neighbor, if they’re peaceful it’s not too hard, unless someone runs away on ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/civ5/comments/1fszao0/how_often_can_you_beat_deity/lpo4k9e/"
      },
      {
        "text": "No more TP/tissue in your bedroom",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/AskReddit/comments/1flpcde/deleted_by_user/lo6qtqw/"
      },
      {
        "text": "Oh I hate it when this happens. I remember they were doing all of 10th avenue or something for 20 bl",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/NYCbike/comments/1fg6zch/update_on_the_bedford_ave_bike_lane/ln00ba5/"
      }
    ]
  },
  {
    "chunk_id": "Chunk 20",
    "summary": "The Reddit user 'kojied' has been involved in digital collectibles and NFTs, specifically with platforms like Veve, BitClout, Friendtech, Rally, and NFTs in general. They have experienced significant financial losses, with an estimated investment of around $5k at one point. They are now viewing this as an expensive life lesson and plan to approach future hype with more caution.\n\nIn their opinion, the founders of the platforms may have had good intentions but failed to deliver on their promises. They believe that brands partnering with NFT platforms saw it primarily as a marketing opportunity, and the lack of interest in NFTs from the mainstream has led to the topics being written off and swept under the rug.\n\n'Kojied' finds humor in having no signal on trains, observing people compulsively refreshing their social media feeds even when they know it won't load. They have had diverse and interesting interactions with fellow students in a masters program, including debates about religion among individuals from different backgrounds. They mention that their school peers would leave parties at 10 PM, which they found to be responsible behavior.",
    "sources": [
      {
        "text": "At this point I've written off all my purchases as a loss. I think I had like 5k in it at some point",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/NFT/comments/1fg5e27/marvel_and_disney_nfts_promising_true_ownership/ln001f2/"
      },
      {
        "text": "I appreciate you guys continuing to build this despite the current situation. Please keep it coming!",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/VisionPro/comments/1fg6j3x/this_week_on_explore_pov_4_new_experiences_from/lmzzlrm/"
      },
      {
        "text": "The founders may have had good intentions, but they definitely didn’t deliver on them. As for the br",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/NFT/comments/1fg5e27/marvel_and_disney_nfts_promising_true_ownership/lmzqdsj/"
      },
      {
        "text": "I actually like having no signal on the trains. It's funny seeing people frantically refreshing thei",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/nycrail/comments/1f90mo6/new_york_city_subway_s_line_gets_cellphone/lliqnpr/"
      },
      {
        "text": "Had some in my school (masters program). Very positive and fun people to be around. Pretty racially ",
        "permalink": "https://www.reddit.comhttps://www.reddit.com/r/GenZ/comments/1f2ngkc/have_you_ever_met_any_non_missionary_mormons_if/lk7nzon/"
      }
    ]
  }
]